//=============================================================================
//
// リザルトの処理 [Monitor.h]
// Author : Mikiya Meguro
//
//=============================================================================
#ifndef _MONITOR3_H_
#define _MONITOR3_H_

#include "main.h"
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitMonitor3(void);
void UninitMonitor3(void);
void UpdateMonitor3(void);
void DrawMonitor3(void);

#endif
