//=============================================================================
//
// リザルトの処理 [Monitor.h]
// Author : Mikiya Meguro
//
//=============================================================================
#ifndef _MONITOR_H_
#define _MONITOR_H_

#include "main.h"
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitMonitor(void);
void UninitMonitor(void);
void UpdateMonitor(void);
void DrawMonitor(void);

#endif
