//=============================================================================
//
// リザルトの処理 [Monitor.h]
// Author : Mikiya Meguro
//
//=============================================================================
#ifndef _MONITOR2_H_
#define _MONITOR2_H_

#include "main.h"
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitMonitor2(void);
void UninitMonitor2(void);
void UpdateMonitor2(void);
void DrawMonitor2(void);

#endif
