//=============================================================================
//
// タイマー処理 [timer.h]
// Author : Kodama Yuto
//
//=============================================================================
#ifndef _TIMER2_H_
#define _TIMER2_H_

#include "main.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TIMER_INTERVAL (60)			//タイマーの間隔
#define TIMER_COUNT_COEFFICIENT (5)
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitTimer2(void);
void UninitTimer2(void);
void UpdateTimer2(void);
void DrawTimer2(void);

void SetTimer2(int nTime);
int GetTimer2(void);
bool GetSetTimer2Flag(void);
#endif
