//=============================================================================
//
// タイマー処理 [timer.h]
// Author : Kodama Yuto
//
//=============================================================================
#ifndef _TIMER_H_
#define _TIMER_H_

#include "main.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TIMER_INTERVAL (60)			//タイマーの間隔
#define TIMER_COUNT_COEFFICIENT (5)
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitTimer(void);
void UninitTimer(void);
void UpdateTimer(void);
void DrawTimer(void);

void SetTimer(int nTime);
int GetTimer(void);
bool GetSetTimerFlag(void);
#endif
