//=============================================================================
//
// 背景(バックグラウンド)処理 [bg.h]
// Author : ABE YUUTAROU
//
//=============================================================================
#ifndef _BG3_H_			//	2重インクルード防止のマクロ定義
#define _BG3_H_

#include "main.h"

#define MAX_BG (128)

//*****************************************************************************
//プロトタイプ宣言
//*****************************************************************************
void InitBG3(void);		//初期化処理バックグラウンド
void UninitBG3(void);	//終了処理バックグラウンド
void UpdateBG3(void);	//更新処理バックグラウンド
void DrawBG3(void);		//描画処理バックグラウンド

#endif // !

