//=============================================================================
//
// チュートリアル画面処理 [tutorial.h]
// Author : Niwa Hodaka
//
//=============================================================================
#ifndef _TUTORIALBG_H_
#define _TUTORIALBG_H_

#include "main.h"

//*****************************************************************************
//構造体
//*****************************************************************************
typedef enum
{
	TUTO_NOMAL = 0,		//通常
	TUTO_END,
	TUTO_MAX
}TUTOSTATE;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitTutorialBG(void);
void UninitTutorialBG(void);
void UpdateTutorialBG(void);
void DrawTutorialBG(void);

#endif