//=+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==
//
// ポーズメニュー処理 [pausemenu.h]
// Author : 圷 和也
//
//=+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==+==
#ifndef _PAUSEMENU_H_
#define _PAUSEMENU_H_

#include "main.h"

//*-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**
// マクロ定義
//*-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**

//*-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**
// 構造体定義
//*-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**
typedef enum
{
	MENU_CONTINUE = 0,		// コンテニュー
	MENU_RULEBOOK,			// ルールブック
	MENU_QUIT,				// クウィット
	MAX_MENU
}PAUSEMENUTYPE;

typedef struct
{
	D3DXVECTOR3 pos;	// 位置
	D3DXCOLOR	col;	// 色
	int nTexType;		// テクスチャの種類
	float fWidth;		// 横幅
	float fHeight;		// 縦幅
	bool bUse;			// 使用しているかどうか
	bool bSelect;		// 選択されているかどうか
}Pausemenu;
//*-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**
// プロトタイプ宣言
//*-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**-**
void InitPausemenu(void);
void UninitPausemenu(void);
void UpdatePausemenu(void);
void DrawPausemenu(void);
void SetPauseMenu(D3DXVECTOR3 pos, int Textype, float fWidth, float fHeight);
int GetPauseSelect(void);
void InitPauseSelect(void);

#endif
