//=============================================================================
//
// タイム処理 [timer.h]
// Author : EbinaRiku
//
//=============================================================================
#ifndef _TIMER_H_
#define _TIMER_H_

#include "main.h"
#define MAX_TIME			(15)				// 最大時間
//*****************************************************************************
// 構造体の定義
//*****************************************************************************
typedef enum
{
	TIMERTYPE_COUNT = 0,	// スコア
	TIMERTYPE_FRAME,		// フレーム
	TIMERTYPE_MAX
}TIMERTYPE;

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	int nTime;		// 時間
	bool bUseTime;	// 使用状況
	bool bFinish;
}Timer;
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitTimer(void);
void UninitTimer(void);
void UpdateTimer(void);
void DrawTimer(void);
Timer *GetTimer(void);
void SetTimerSwitch(bool bSwitch);
#endif
