//*****************************************************************************
//
//		ポーズの処理[pause.h]
//		Auther :  YUTARO ABE
//
//*****************************************************************************
#ifndef _PAUSE_H_
#define _PAUSE_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CScene2D;				// シーン2D

//*****************************************************************************
//		マクロ定義
//*****************************************************************************
#define POLYGON_PAUSE	(3)		// ポーズのtexture数
#define POLYGON_PRESS	(5)

//*****************************************************************************
//		クラス定義(ポーズ)
//*****************************************************************************
class CPause
{
public:
	CPause();										//	コンストラクタ
	~CPause();										//	デストラクタ
													//	初期化
	HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR3 size, D3DXCOLOR col, D3DXVECTOR2 UV);
	void Uninit(void);								//	終了
	void Update();									//	更新
	void Draw(void);								//	描画
													//	生成
	static CPause *Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, D3DXCOLOR col, D3DXVECTOR2 UV);
	static HRESULT Load(void);						//	読み込み
	static void Unload(void);						//	texture破棄
	static int GetNum(void) { return m_nNum; }		//	番号の取得

private:
	static int m_nNum;								//	番号
};

#endif

