//=============================================================================
//
// クリア画面処理 [clear.h]
// Author : ABE YUUTAROU
//
//=============================================================================
#ifndef _CLEAR_H_			//	2重インクルード防止のマクロ定義
#define _CLEAR_H_

//*****************************************************************************
//プロトタイプ宣言
//*****************************************************************************
void InitCLEAR(void);		//初期化処理タイトル
void UninitCLEAR(void);		//終了処理タイトル
void UpdateCLEAR(void);		//更新処理タイトル
void DrawCLEAR(void);		//描画処理タイトル

#endif // !

