//=============================================================================
//
// 背景(バックグラウンド)処理 [frontbg.h]
// Author : ABE YUUTAROU
//
//=============================================================================
#ifndef _FRONTBG_H_			//	2重インクルード防止のマクロ定義
#define _FRONTBG_H_

#include "main.h"

#define MAX_FRONTBG (128)
//=============================================================================
//構造体
//=============================================================================
typedef struct
{
	D3DXVECTOR3 pos;	//位置
	bool bUse;			//使用されているか
	int nCounterAnim; //アニメーションカウンター
	int nType;			//種類
						//int nPatternAnim;   //アニメーションパターンNo
}FRONTBG;
//*****************************************************************************
//プロトタイプ宣言
//*****************************************************************************
void InitFRONTBG(void);		//初期化処理バックグラウンド
void UninitFRONTBG(void);	//終了処理バックグラウンド
void UpdateFRONTBG(void);	//更新処理バックグラウンド
void DrawFRONTBG(void);		//描画処理バックグラウンド

#endif // !

