//=============================================================================
//
// リザルト処理 [result.h]
// Author : ABE YUUTAROU
//
//=============================================================================
#ifndef _RESULT_H_			//	2重インクルード防止のマクロ定義
#define _RESULT_H_

//*****************************************************************************
//プロトタイプ宣言
//*****************************************************************************
void InitRESULT(void);		//初期化処理タイトル
void UninitRESULT(void);		//終了処理タイトル
void UpdateRESULT(void);		//更新処理タイトル
void DrawRESULT(void);		//描画処理タイトル

#endif // !

