//=============================================================================
//
// タイトル処理 [Arasuji.h]
// Author : ABE YUUTAROU
//
//=============================================================================
#ifndef _ARASUJI_H_			//	2重インクルード防止のマクロ定義
#define _ARASUJI_H_

//*****************************************************************************
//構造体
//*****************************************************************************
typedef enum
{
	ARASUJI_NOMAL = 0,		//通常
	ARASUJI_END,
	ARASUJI_MAX
}ARASUJISTATE;
//*****************************************************************************
//プロトタイプ宣言
//*****************************************************************************
void InitArasuji(void);		//初期化処理タイトル
void UninitArasuji(void);		//終了処理タイトル
void UpdateArasuji(void);		//更新処理タイトル
void DrawArasuji(void);		//描画処理タイトル

#endif // !