//=============================================================================
//
// ポーズ処理 [pause.h]
// Author : ABE YUUTAROU
//
//=============================================================================
#ifndef _PAUSE_H_			//	2重インクルード防止のマクロ定義
#define _PAUSE_H_

#include "main.h"

//*****************************************************************************
//プロトタイプ宣言
//*****************************************************************************
void InitPause(void);		//初期化処理ライフ外付け
void UninitPause(void);	//終了処理ライフ外付け
void UpdatePause(void);	//更新処理ライフ外付け
void DrawPause(void);		//描画処理ライフ外付け

#endif // !