//=============================================================================
//
//	リザルト処理 [result.h]
// Author : ABE YUUTAROU
//
//=============================================================================
#ifndef _RESULT_H_			//	2重インクルード防止のマクロ定義
#define _RESULT_H_

//*****************************************************************************
//構造体
//*****************************************************************************
typedef enum
{
	RESULT_NOMAL = 0,		//通常ダメージ
	RESULT_END,
	RESULT_MAX
}RESULTSTATE;

//*****************************************************************************
//プロトタイプ宣言
//*****************************************************************************
void InitResult(void);		//初期化処理タイトル
void UninitResult(void);		//終了処理タイトル
void UpdateResult(void);		//更新処理タイトル
void DrawResult(void);		//描画処理タイトル

#endif // !
