//=============================================================================
//
// ゲームタグ処理 [tagu].h]
// Author : ABE YUUTAROU
//
//=============================================================================
#ifndef _TAGU_H_			//	2重インクルード防止のマクロ定義
#define _TAGU_H_

#include "main.h"

//*****************************************************************************
//プロトタイプ宣言
//*****************************************************************************
void InitTagu(void);		//初期化処理ライフ外付け
void UninitTagu(void);	//終了処理ライフ外付け
void UpdateTagu(void);	//更新処理ライフ外付け
void DrawTagu(void);		//描画処理ライフ外付け

#endif // !

