//=============================================================================
//
// ライフ外付け処理 [nlife.h]
// Author : ABE YUUTAROU
//
//=============================================================================
#ifndef _NLIFE_H_			//	2重インクルード防止のマクロ定義
#define _NLIFE_H_

#include "main.h"

//*****************************************************************************
//プロトタイプ宣言
//*****************************************************************************
void InitNlife(void);		//初期化処理ライフ外付け
void UninitNlife(void);	//終了処理ライフ外付け
void UpdateNlife(void);	//更新処理ライフ外付け
void DrawNlife(void);		//描画処理ライフ外付け

#endif // !

