//=============================================================================
//
//チュートリアル処理 [tutorial.h]
// Author : ABE YUUTAROU
//
//=============================================================================
#ifndef _TUTORIAL_H_			//	2重インクルード防止のマクロ定義
#define _TUTORIAL_H_


//*****************************************************************************
//プロトタイプ宣言
//*****************************************************************************
void InitTUTORIAL(void);		//初期化処理チュートリアル
void UninitTUTORIAL(void);		//終了処理チュートリアル
void UpdateTUTORIAL(void);		//更新処理チュートリアル
void DrawTUTORIAL(void);		//描画処理チュートリアル

#endif // !

