//=============================================================================
//
//　クレジットの処理 [credit.h]
//	Author : YUUTAROU ABE
//
//=============================================================================
#ifndef _CREDIT_H_
#define _CREDIT_H_

//=============================================================================
//	インクルードファイル
//=============================================================================
#include "main.h"
#include "manager.h"

//=============================================================================
//	マクロ定義
//=============================================================================
#define MAX_CREDIT_UI (2)			//	クレジットのUIの最大数

//=============================================================================
//	マネージャークラス
//=============================================================================
class CCredit
{
public:
	CCredit();																//	コンストラクタ
	~CCredit();																//	デストラクタ
	HRESULT Init(void);														//	初期化処理
	void Uninit(void);														//	終了処理
	void Update(void);														//	更新処理
	void Draw(void);														//	描画処理
	static  HRESULT Load(void);												//	テクスチャをロード
	static void UnLoad(void);												//	テクスチャを開放
private:
	CScene2D *m_apScene2D[MAX_CREDIT_UI];
	static LPDIRECT3DTEXTURE9		m_pTexture[MAX_CREDIT_UI];				//	テクスチャ複数
	int m_nCounterAnim;														//	カウンターアニメーション
	int m_nPatternAnim;														//	アニメーションカウンター
	bool m_bPressState;														//	ボタン押しているかどうか
};

#endif // _MANAGER_H_
