//=============================================================================
//
// メイン処理 [main.h]
// Author :
//
//=============================================================================
#ifndef _MAIN_H_
#define _MAIN_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include <windows.h>
#include "d3dx9.h"
#define DIRECTINPUT_VERSION (0x0800)
#include "dinput.h"
#include "xaudio2.h"					//サウンド処理で必要
#include "stdio.h"
#include <time.h>
#include <stdlib.h>

//*****************************************************************************
// ライブラリファイルのリンク
//*****************************************************************************
#pragma comment (lib,"d3d9.lib")
#pragma comment (lib,"d3dx9.lib")
#pragma comment (lib,"dxguid.lib")
#pragma comment (lib,"winmm.lib")
#pragma comment (lib,"dinput8.lib")
//#include "input.h"
#include "xaudio2.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define SCREEN_WIDTH (1280)
#define SCREEN_HEIGHT (720)
#define FVF_VERTEX_2D (D3DFVF_XYZRHW | D3DFVF_DIFFUSE | D3DFVF_TEX1)

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;
	float rhw;
	D3DCOLOR col;
	D3DXVECTOR2 tex;
	D3DXVECTOR3 rot;
}VERTEX_2D;



//*****************************************************************************
//前方宣言
//*****************************************************************************
class CRenderer;
class CScene;
class CScene2D;
class CManager;
class CInput;

//*****************************************************************************
//プロトタイプ宣言
//*****************************************************************************
int GetFPS(void);

#endif